In [1]:
# prep: import modules and get pwd
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [2]:
# get the data
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

In [3]:
query = '''SELECT f.rental_duration, f.rental_rate, f.length, f.rating, fc.category_id FROM film f
JOIN film_category fc
USING (film_id);'''

data = pd.read_sql_query(query, engine)
data.head()

   rental_duration  rental_rate  length rating  category_id
0                6         0.99     113     PG            1
1                3         4.99     129      R            1
2                5         2.99     168  NC-17            1
3                6         0.99      68  NC-17            1
4                6         2.99     129      G            1

In [4]:
# Create temp table

sql = '''CREATE TEMPORARY TABLE rentedmay AS (
  SELECT film_id, f.title FROM rental r
JOIN inventory i USING (inventory_id)
JOIN film f USING (film_id)
WHERE rental_date LIKE '%%2005-05%%'
GROUP BY film_id
ORDER BY rental_date
);'''
engine.execute(sql)

In [5]:
# Use temp table with left join to get NaNs in Column title for movies that havn't been rented in May

query2 = '''SELECT f.rental_duration, f.rental_rate, f.length, f.rating, fc.category_id, film_id, re.title FROM film f
JOIN film_category fc
USING (film_id)
LEFT JOIN rentedmay re
USING (film_id)
ORDER BY film_id;'''

data2 = pd.read_sql_query(query2, engine)

data2.head()

,rental_duration,rental_rate,length,rating,category_id,film_id,title
0,6,0.99,86,PG,6,1,ACADEMY DINOSAUR
1,3,4.99,48,G,11,2,None
2,7,2.99,50,NC-17,6,3,ADAPTATION HOLES
3,5,2.99,117,G,11,4,AFFAIR PREJUDICE
4,6,2.99,130,G,8,5,AFRICAN EGG

In [6]:
# data2['title'] = data2['title'].fillna('FALSE')

In [7]:
import numpy as np
data2['title'] = np.where((data2['title'] != 'None'), 'TRUE', 'FALSE')
data2

     rental_duration  rental_rate  length rating  category_id  film_id title
0                  6         0.99      86     PG            6        1  TRUE
1                  3         4.99      48      G           11        2  TRUE
2                  7         2.99      50  NC-17            6        3  TRUE
3                  5         2.99     117      G           11        4  TRUE
4                  6         2.99     130      G            8        5  TRUE
..               ...          ...     ...    ...          ...      ...   ...
995                6         0.99     183      G            6      996  TRUE
996                4         0.99     179  NC-17           12      997  TRUE
997                6         0.99     105  NC-17           11      998  TRUE
998                5         2.99     101      R            3      999  TRUE
999                3         4.99      50  NC-17            5     1000  TRUE

[1000 rows x 7 columns]

In [ ]:
data2['title'].value_counts()